---
kind: type
id: T:Autodesk.Revit.DB.ScheduleHeightsOnSheet
source: html/1af9b0b7-3949-6478-aea8-7e3d04bec24b.htm
---
# Autodesk.Revit.DB.ScheduleHeightsOnSheet

Heights information of a schedule on sheet.

## Syntax (C#)
```csharp
public class ScheduleHeightsOnSheet : IDisposable
```

## Remarks
This class returns the heights of schedule title, column header and each body row on sheet view.